In [2]:
import pandas as pd

In [3]:
forestArea = {
    'Assam': pd.Series([78438, 2797, 10192, 15116], index = ['GeoArea', 'VeryDense', 'ModeratelyDense', 'OpenForest']),
    'Kerala': pd.Series([ 38852, 1663, 9407, 9251], index = ['GeoArea' ,'VeryDense', 'ModeratelyDense', 'OpenForest']),
    'Delhi': pd.Series([1483, 6.72, 56.24, 129.45], index = ['GeoArea', 'VeryDense', 'ModeratelyDense', 'OpenForest'])
}

In [4]:
pd.read_csv('dataframe.csv', names=['Nerd', 'Second', 'Third'], header=0, index_col=0)

      Nerd  Second   Third
I   Reshma  Rajesh   Rahul
II  Ranjan    Raul  Rakesh

In [5]:
marksUT = pd.DataFrame({
    'Name': ['Raman', 'Raman', 'Raman', 'Zuhaire', 'Zuhaire', 'Zuhaire', 'Ashravy', 'Ashravy', 'Ashravy', 'Mishti', 'Mishti', 'Mishti'],
    'UT': [1, 2, 3, 1, 2, 3, 1, 2, 3, 1, 2, 3],
    'Maths': [22, 21, 14, 20, 23, 22, 23, 24, 12, 15, 18, 17],
    'Science': [21, 20, 19, 17, 15, 18, 19, 22, 25, 22, 21, 18],
    'Social Studies': [18, 17, 15, 22, 21, 19, 20, 24, 19, 25, 25, 20],
    'Hindi': [20, 22, 24, 24, 25, 23, 15, 17, 21, 22, 24, 25],
    'English': [21, 24, 23, 19, 15, 13, 22, 21, 23, 22, 23, 20]
 })

In [6]:
marksUT

       Name  UT  Maths  Science  Social Studies  Hindi  English
0     Raman   1     22       21              18     20       21
1     Raman   2     21       20              17     22       24
2     Raman   3     14       19              15     24       23
3   Zuhaire   1     20       17              22     24       19
4   Zuhaire   2     23       15              21     25       15
5   Zuhaire   3     22       18              19     23       13
6   Ashravy   1     23       19              20     15       22
7   Ashravy   2     24       22              24     17       21
8   Ashravy   3     12       25              19     21       23
9    Mishti   1     15       22              25     22       22
10   Mishti   2     18       21              25     24       23
11   Mishti   3     17       18              20     25       20

In [7]:
marksUT[marksUT.Name == 'Mishti'].drop(['Name', 'UT'], axis=1).sum()

Maths             50
Science           61
Social Studies    70
Hindi             71
English           65
dtype: int64

In [ ]:
projects = pd.DataFrame({
    'Bijon': {
        'Topic': '',
        'Mentor': ''
    },
    'Harsh': {
        'Topic': 'Encrypted communication between IoT devices.',
        'Mentor': 'TM'
    },
    'Niloy': {
        'Topic': 'Object detection using ML.',
        'Mentor': ''
    },
    'Sayon': {
        'Topic': 'Best ever CS department over-stack website.',
        'Mentor': ''
    },
    'Arpan Pal': {

    },
    'Arpan Saha': {

    },
    'Ankush Kumar Giri': {

    },
    'Suravi Bhattacharjee': {

    }
})

In [ ]:
projects.to_excel()

       Bijon
Topic
Mentor